### Success [Jenkins Build](https://k8s.core-services.aws.idt.net/terra-jenkins/job/terra-live/job/zoho-crm-terra-live/job/PR-13/1/): 
[Info] Plan for apply:
# qa

## Changes
```diff
+ create
+ resource "aws_sqs_queue" "dead_letter_queue" {
+ resource "aws_sqs_queue" "this" {
# aws_sqs_queue.dead_letter_queue will be created
# aws_sqs_queue.this will be created

```
<details>
  <summary>SHOW DETAILED PLAN</summary>
  <pre>
module.datasources.data.terraform_remote_state.route53: Refreshing state...
module.datasources.data.aws_s3_bucket_objects.infra_states: Refreshing state...
module.datasources.data.aws_s3_bucket_objects.core_states: Refreshing state...
module.datasources.data.terraform_remote_state.vpc: Refreshing state...
module.iam.aws_iam_role.this[0]: Refreshing state... [id=zoho-crm-qa-convert-lead]
------------------------------------------------------------------------
------------------------------------------------------------------------
This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
Terraform will perform the following actions:
  # aws_sqs_queue.dead_letter_queue will be created
  + resource "aws_sqs_queue" "dead_letter_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "zoho-crm-qa-convert-lead-DLQ"
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + tags                              = {
          + "Name"                      = "zoho-crm-qa-convert-lead-DLQ"
          + "devops:terraform"          = "Managed by Terraform"
          + "idt:applications_group"    = "not provided"
          + "idt:asset_name"            = "zoho-crm"
          + "idt:environment_type"      = "qa"
          + "idt:github_team_id"        = "not provided"
          + "idt:jira_project_id"       = "not provided"
          + "idt:lob"                   = "tech_dev_br_general"
          + "idt:opsgenie_service_name" = "not provided"
          + "idt:resource_owner_email"  = "not provided"
          + "idt:team_name"             = "zoho-crm"
          + "idt:team_slack_channel"    = "not provided"
        }
      + visibility_timeout_seconds        = 43200
    }
  # aws_sqs_queue.this will be created
  + resource "aws_sqs_queue" "this" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "zoho-crm-qa-convert-lead"
      + policy                            = jsonencode(
            {
              + Id        = "__default_policy_ID"
              + Statement = [
                  + {
                      + Action    = "sqs:SendMessage"
                      + Condition = {
                          + ArnEquals = {
                              + AWS:SourceArn = [
                                  + "arn:aws:sns:us-east-1:470427355418:zoho-crm-qa-convert-lead",
                                  + "arn:aws:iam::470427355418:role/IDT-RAMS-Instance-Profile",
                                  + "arn:aws:ecs:us-east-1:470427355418:service/retail-billing-qa/rams",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:sqs:us-east-1:470427355418:zoho-crm-qa-convert-lead"
                      + Sid       = "SendMessageCustomPolicy"
                    },
                  + {
                      + Action    = "sqs:SendMessage"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "470427355418"
                        }
                      + Resource  = "arn:aws:sqs:us-east-1:470427355418:zoho-crm-qa-convert-lead"
                      + Sid       = "SendMessageDefaultPolicy"
                    },
                  + {
                      + Action    = [
                          + "sqs:ReceiveMessage",
                          + "sqs:GetQueueAttributes",
                          + "sqs:DeleteMessage",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "470427355418"
                        }
                      + Resource  = "arn:aws:sns:us-east-1:470427355418:zoho-crm-qa-convert-lead"
                      + Sid       = "ReceiveMessageDefaultPolicy"
                    },
                  + {
                      + Action    = [
                          + "sqs:ReceiveMessage",
                          + "sqs:GetQueueAttributes",
                          + "sqs:DeleteMessage",
                        ]
                      + Condition = {
                          + ArnEquals = {
                              + AWS:SourceArn = [
                                  + "arn:aws:iam::470427355418:role/IDT-RAMS-Instance-Profile",
                                  + "arn:aws:iam::470427355418:role/AWSReservedSSO_SNS_SQS_Full_access_8c23d4369c63116e",
                                  + "arn:aws:ecs:us-east-1:470427355418:service/retail-billing-qa/rams",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:sns:us-east-1:470427355418:zoho-crm-qa-convert-lead"
                      + Sid       = "ReceiveMessageCustomPolicy"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + receive_wait_time_seconds         = 0
      + redrive_policy                    = (known after apply)
      + tags                              = {
          + "Name"                      = "zoho-crm-qa-convert-lead"
          + "devops:terraform"          = "Managed by Terraform"
          + "idt:applications_group"    = "not provided"
          + "idt:asset_name"            = "zoho-crm"
          + "idt:environment_type"      = "qa"
          + "idt:github_team_id"        = "not provided"
          + "idt:jira_project_id"       = "not provided"
          + "idt:lob"                   = "tech_dev_br_general"
          + "idt:opsgenie_service_name" = "not provided"
          + "idt:resource_owner_email"  = "not provided"
          + "idt:team_name"             = "zoho-crm"
          + "idt:team_slack_channel"    = "not provided"
        }
      + visibility_timeout_seconds        = 30
    }
Plan: 2 to add, 0 to change, 0 to destroy.
To perform exactly these actions, run the following command to apply:
    terraform apply "sqs-zoho-crm-qa-convert-lead-failed.out"
No changes. Infrastructure is up-to-date.
This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.
module.datasources.data.aws_s3_bucket_objects.infra_states: Refreshing state...
module.datasources.data.aws_s3_bucket_objects.core_states: Refreshing state...
data.aws_caller_identity.current: Refreshing state...
module.datasources.data.aws_caller_identity.current: Refreshing state...
data.aws_lambda_function.this[0]: Refreshing state...
aws_api_gateway_resource.this: Refreshing state... [id=7u8qr5]
module.datasources.data.terraform_remote_state.codedeploy: Refreshing state...
aws_api_gateway_method.this[0]: Refreshing state... [id=agm-b6t492zfc6-7u8qr5-POST]
aws_api_gateway_method.this[1]: Refreshing state... [id=agm-b6t492zfc6-7u8qr5-OPTIONS]
aws_api_gateway_method_response.this[0]: Refreshing state... [id=agmr-b6t492zfc6-7u8qr5-POST-200]
aws_api_gateway_integration.this[0]: Refreshing state... [id=agi-b6t492zfc6-7u8qr5-POST]
aws_api_gateway_integration.this[1]: Refreshing state... [id=agi-b6t492zfc6-7u8qr5-OPTIONS]
aws_api_gateway_method_response.this[1]: Refreshing state... [id=agmr-b6t492zfc6-7u8qr5-OPTIONS-200]
module.datasources.data.terraform_remote_state.vpc: Refreshing state...
module.datasources.data.terraform_remote_state.route53: Refreshing state...
module.datasources.data.terraform_remote_state.iam: Refreshing state...
aws_api_gateway_deployment.this: Refreshing state... [id=gtw3aj]
aws_api_gateway_integration_response.this[1]: Refreshing state... [id=agir-b6t492zfc6-7u8qr5-OPTIONS-200]
aws_lambda_permission.apigw_trigger[0]: Refreshing state... [id=terraform-20200506135006247500000001]
aws_api_gateway_integration_response.this[0]: Refreshing state... [id=agir-b6t492zfc6-7u8qr5-POST-200]

  </pre>
</details>